package t2;

public class HomeWork {

    //1. 하던 가위바위보 마무리
    //2. 만든 가위바위보를 setter getter를 이용하여 재코딩
    //3. 2번 가위바위보 코딩 된 것을 조금 더 세련디ㅗ게
    // 예를들어 랜덤수 1(가위) 입력수 2(바위)
    // if (r == 1 && b ==2)
    // int result = 1/2 또는 1%2; 나머지 1,2,3 이 나올떄의 승패무 구해서
    // 연산을 통해서 승패를 구하시오.
    //
    // 1/%2 = 0, 1 이긴거
    // 2/%2 = 1, 0 비긴거
    // 3/%2 = 1, 1 진거
    // 1/%3 = 0, 1 진거
    // 2/%3 = 0, 2 이긴거
    // 3/%3 = 1, 0 비긴거
    // 1/%1 = 1, 0 비긴거
    // 2/%1 = 2, 0 진거
    // 3/%1 = 3, 0 이긴거

    //4. for문으로
    //             *
    //            **
    //           ***
    //4 좌측 직각 / 우측 직각
    //4_0 삼가격
    //4_1 역삼각형
    //4_2 다이아몬드
    //4_3 별
}
